{
    "version": "https://jsonfeed.org/version/1",
    "title": "Uveta's blog • All posts by \"certification\" tag",
    "description": "Uveta's blog about all things Azure",
    "home_page_url": "https://www.uveta.io",
    "items": [
        {
            "id": "https://www.uveta.io/categories/blog/azure-solutions-architect-expert-part-2/",
            "url": "https://www.uveta.io/categories/blog/azure-solutions-architect-expert-part-2/",
            "title": "So you want to be an Azure Solutions Architect Expert - Part 2",
            "date_published": "2020-08-19T15:48:14.000Z",
            "content_html": "<html><head></head><body><img src=\"/categories/blog/azure-solutions-architect-expert-part-2/architect-badge.jpg\" class=\"\" title=\"Goal!!!\">\n\n<p>Microsoft Azure Architect Design is the second exam required for obtaining Azure Solutions Architect Expert certification. Backed up by deployment and configuration skills, obtained from preparation for Microsoft Azure Architect Technologies exam, we will tackle design of more complex and robust systems in this part.</p>\n<span id=\"more\"></span>\n\n<p>This post is part of my Azure Architect certification guide:</p>\n<ul>\n<li><a href=\"/categories/blog/azure-solutions-architect-expert-part-1\">So you want to be an Azure Solutions Architect Expert - Part 1</a></li>\n<li><a href=\"/categories/blog/azure-solutions-architect-expert-part-2\">So you want to be an Azure Solutions Architect Expert - Part 2</a> (this post)</li>\n</ul>\n<p><em>Disclaimer: on June 29, AZ-303 and AZ-304 were released, but only as beta for the time being. Exams being replaced, i.e. AZ-300 and AZ-301, will retire on September 30. I will take into account AZ-304 curriculum, and not dwell on AZ-301 topics that are becoming obsolete.</em></p>\n<h2 id=\"So-you-want-to-Solution-Architect-AZ-301-Microsoft-Azure-Architect-Design\"><a href=\"#So-you-want-to-Solution-Architect-AZ-301-Microsoft-Azure-Architect-Design\" class=\"headerlink\" title=\"So you want to Solution Architect (AZ-301: Microsoft Azure Architect Design)\"></a>So you want to Solution Architect (AZ-301: Microsoft Azure Architect Design)</h2><p><img src=\"az-301-badge.png\" alt=\"AZ-301: Microsoft Azure Architect Design\"></p>\n<p>Armed with knowledge of individual Azure services, design exam puts it all together under one roof. As a solution architect it will be your responsibility to create systems fulfilling both functional and non-functional requirements, while taking care not to overstep established restrictions. Desired reliability, availability, scalability and costs heavily influence your architecture and components used, hence a much deeper understanding of Azure services is required.</p>\n<h3 id=\"What-type-of-design-questions-await\"><a href=\"#What-type-of-design-questions-await\" class=\"headerlink\" title=\"What type of design questions await\"></a>What type of design questions await</h3><p>Question formats do not diverge much from the ones mentioned in <a href=\"/categories/blog/azure-solutions-architect-expert-part-1/#What-type-of-technology-questions-await\">previous post</a>. You should however expect many more case-studies, which best suit to illustrate obstacles confronted by a system designer.</p>\n<h3 id=\"Where-to-find-study-materials\"><a href=\"#Where-to-find-study-materials\" class=\"headerlink\" title=\"Where to find study materials\"></a>Where to find study materials</h3><p><img src=\"microsoft-docs-architecture.PNG\" alt=\"Microsoft Azure architecture documentation\"></p>\n<p>The same can be said for study materials. Microsoft documentation and video courses I previously suggested offer more than enough information needed to pass design exam as well. Special significance should be paid to <a href=\"https://docs.microsoft.com/en-us/azure/architecture/\">Azure architecture section</a>, containing reference architectures for different types of deployments. I suggest studying most commonly used ones by analyzing individual components and how they fit together to achieve desired system requirements.</p>\n<h3 id=\"Availability\"><a href=\"#Availability\" class=\"headerlink\" title=\"Availability\"></a>Availability</h3><p><img src=\"multi-region-web-app-diagram.png\" alt=\"App Service in multiple regions\"></p>\n<p>Understanding how Azure datacenters are organized on a global scale is imperative when planning for availability of your deployment. Although Microsoft offers generous SLA for all of its services, outages happen, and careful planning can help you mitigate such interruptions. Most important terms, covered by design exam, include:</p>\n<ul>\n<li>Datacenter. Basic building block of Azure, consisting of physical devices, storage, power and network connections.</li>\n<li>Availability zone. Collection of one or more datacenters with independent power and network connections. Most Azure resources can be distributed between different availability zones, helping against individual datacenter outages.</li>\n<li>Region. Specific location where Azure resources are deployed, guaranteeing compliance and data residency for specific state or country where datacenters are located. With regard to availability zones, each region contains at least 3 of them.</li>\n<li>Regional pair. Each Azure region is paired with another one, with prescribed minimum distance between them. This ensures resiliency in case of regional outages, due to natural disasters or any similar impediments. Any service update is rolled to one region per pair at a time. Also, in case of global Azure outage, Microsoft will prioritize restoring only one region per pair.</li>\n<li>Geography. Regions belonging to the same country are organized into geographies. Any regional pair is usually a part of the same geography, ensuring compliance and data residency. Exceptions do exists, especially for new geographies where usually only one region is deployed.</li>\n</ul>\n<p>Besides knowing how outage in any part of Azure infrastructure could affect you, it is vital to understand where each type of resources is deployed. While most of them are being deployed to specific regions, some of them, e.g. Traffic Manager, are non-regional and are deployed globally. Knowing which services allow distribution into availability zones, in order to handle datacenter outages, is also required.</p>\n<h3 id=\"Reliability\"><a href=\"#Reliability\" class=\"headerlink\" title=\"Reliability\"></a>Reliability</h3><p>When designing backup and recovery solution, it is imperative to take into account target Recovery Time Objectives (RTO) and Recovery Point Objectives (RPO). Simply put, they both impose requirements on how your system should behave in case of an outage. While RTO determines maximum period of time an outage is allowed to last, RPO specifies permitted amount of data loss during recovery. For critical system components these values would normally be expressed in seconds, while rarely used or obsolete parts could afford even daily outages. Values imposed by these requirements have great impact not only during recovery design, but also when optimizing costs, which I will cover in the following sections.</p>\n<p>To successfully conquer this part of the exam, deeper understanding of two services is required:</p>\n<ul>\n<li>Azure Backup. As the name implies, the service is used for managing backups of other services, be it Azure VM disks, on-premise file systems or SQL servers running on Azure VMs. Although you should be familiar with configuring and deploying it from technologies exam, understanding costs and data retention specifics will be required on design exam.</li>\n<li>Azure Site Recovery. This one is a complex hydra, since it can span multiple Azure regions and even handle on-premise systems connected via VPN. It heavily relies on Backup service and removes the need for manual intervention in case of a failure. I recommend spending some time trying out Site Recovery in Azure Portal, if you have a chance. How to identify failure (both infrastructure and application), how to recover to a secondary deployment (both Azure and on-premise) and how to minimize amount of lost data and downtime (RPO and RTO) are just some of the areas you will need to be proficient in. Luckily, Site Recovery allows manual failovers, allowing you to test and get a good grip on what can happen in case of a system failure.</li>\n</ul>\n<h3 id=\"Scalability\"><a href=\"#Scalability\" class=\"headerlink\" title=\"Scalability\"></a>Scalability</h3><p><img src=\"serverless-web-app.png\" alt=\"Scalable serverless application\"></p>\n<p>Most compute and database resources, offered by Azure, support scaling out of the box. The trick is knowing which service tier you have to use for specific resource type, as well how to effectively configure scaling to support increase of demand. Whether you are using VM scale sets or App Service, knowing how to configure auto-scaling rules and conditions is a must. Even services such as Function App, which inherently handle scaling, support further adjustments to it. This can be used to control burst of work and better handle costs of potentially unlimited compute resources.</p>\n<p>All previously mentioned areas (availability, reliability and scalability) represent pillars of any highly available and resilient deployment. I would once again emphasize the importance of <a href=\"https://docs.microsoft.com/en-us/azure/architecture/\">Azure architecture documentation</a>, which is an endless pool of reference architectures, allowing building systems fulfilling specific set of requirements.</p>\n<h3 id=\"Security\"><a href=\"#Security\" class=\"headerlink\" title=\"Security\"></a>Security</h3><p>As with any cloud environment, security is involved in almost all of Azure’s components and processes. For the purpose of design exam, I would divide security topics into following:</p>\n<ul>\n<li>User management, authentication and authorization. Beside knowing how to work with Azure AD and role-based access control (RBAC), which were covered in technologies exam, you will be expected to handle more advanced scenarios and options offered by Azure AD. Configuring single-sign on (SSO), multi-factor authentication (MFA) and dealing with hybrid identity using Azure AD Connect are just some of the examples. As you are expected to handle enterprise level deployments, automating and auditing certain tasks will be a necessity. Hence premium AD options such as Privileged Identity Management (PIM), self-service management, Identity Protection and Just In Time (JIT) VM access should not flow under your radar.</li>\n<li>Application security. Securing our compute resources comes in two flavours: handling service access to other Azure resources and protecting application data. While Managed Identity can handle service authentication, using service principals and RBAC, Azure Key Vault is usually used for storing sensitive application settings and certificates.</li>\n<li>Data protection. As our systems will deal with user data, it is imperative for all of its components to safeguard it. By designing a system that encrypts data at rest, in transit and while in use we can minimize the possibility and impact of data exposure. Knowing how different resources, based on their purpose, handle each part of data flow is a key to conquering these problems.</li>\n</ul>\n<h3 id=\"Cost-optimization\"><a href=\"#Cost-optimization\" class=\"headerlink\" title=\"Cost optimization\"></a>Cost optimization</h3><p>First step into providing good cost optimization is knowing when and how are you charged for using Azure resources. Although some costs are fixed, e.g each GB stored, VM reserved, certificate purchased and public IP address assigned, others are charged per usage unit, such as FunctionApp and Container Instances execution time, number of read/write requests to storage accounts and Cosmos DB request units, just to name a few. Different service tiers can also dramatically affect costs of entire deployment, due to extra features offered and more strict SLAs. No one will expect of you to provide exact price of deployment, but knowing how to reduce costs, while still adhering to requirements imposed, will be vital. </p>\n<p>In case of designing for reliability, you will mostly be faced with task of minimizing deployment cost, while maintaining specific RTO and RLO values. Knowing how each storage resource (Cosmos DB, blob and file storage) and recovery service (Site Recovery and Backup) handles these parameters is a skill you will have to master.</p>\n<h3 id=\"Governance-and-auditing\"><a href=\"#Governance-and-auditing\" class=\"headerlink\" title=\"Governance and auditing\"></a>Governance and auditing</h3><p>All parts of an enterprise must be compliant with pre-established rules, which does not exempt deployments made to Azure. Governance in Azure further includes creating and adhering completely new set of rules, specific for cloud environment. As an example, you could be tasked with designing resource tagging policy, in order to help identify business unit, application or employees responsible for specific resource or groups of resources.</p>\n<p>In order to ensure all deployed resources are compliant, Azure allows us to define policies for different scopes, i.e directory, subscription, resource group, etc. This goes even beyond deployments, as policy rules can be applied to user accounts, RBAC and other security entities governed by Azure AD. Azure Blueprints makes work with policies more straightforward, giving us possibility to define compliant resource templates ready for deployment. Blueprints go much further than simple ARM templates, as they are backed up by Cosmos DB, available to any user or group with access rights, and provide audit log upon deployment.</p>\n<h3 id=\"Miscellaneous\"><a href=\"#Miscellaneous\" class=\"headerlink\" title=\"Miscellaneous\"></a>Miscellaneous</h3><p>I will briefly cover further topics encountered during exam, that are not as extensive as previously mentioned ones.</p>\n<h4 id=\"Networking\"><a href=\"#Networking\" class=\"headerlink\" title=\"Networking\"></a>Networking</h4><p>Since virtual networks are ties that bind all other Azure resources, knowing how to design and utilize them is something that can not be overlooked. As they fall within the competence of Microsoft, you will have little influence over their operation and reliability. However, architect’s responsibility lay in other areas. Modeling addressing strategy for networks and sub-networks, connecting virtual networks and on-premise systems, directing network flow via routing and load balancers, as well as establishing security boundaries and rules are just some of the skills that will be expected of you on design exam.</p>\n<h4 id=\"Compute\"><a href=\"#Compute\" class=\"headerlink\" title=\"Compute\"></a>Compute</h4><p>Similar skills to ones required in technical exam are required, as choosing appropriate compute solution is still the main focus. There will however be additional requirements, requiring deeper knowledge of pricing tiers and respective offerings, total resource costs as well as scaling capabilities. Resource types covered by design exam are virtual machines, virtual machine scale sets, App Services, Service Fabric, Function Apps and containerized deployments. Regarding last one, make sure you understand difference between Azure Kubernetes Service and Azure Container Instances.</p>\n<h4 id=\"Archiving-and-data-retention\"><a href=\"#Archiving-and-data-retention\" class=\"headerlink\" title=\"Archiving and data retention\"></a>Archiving and data retention</h4><p>Storing not-frequently accessed data for auditing and compliance purposes is a necessity by today’s standards. Almost all Azure storage services include an archive tier, so you should be covered whether you are using Storage Accounts, Data Lake or Azure Backup, just to name a few. You would still need to know how to calculate the costs of archiving data, as well as special conditions for storing and accessing it.</p>\n<h2 id=\"Conclusion\"><a href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"></a>Conclusion</h2><p>In this post I described most important topics that are covered by AZ-301: Microsoft Azure Architect Design exam. Including previous post in the series, I have covered complete curriculum for Azure Solutions Architect Expert exam in its current form.</p>\n<p>If you would have any additional questions or remarks, I am eager to hear them in the comments bellow. If you are interested in future posts from Azure and .NET world, follow me on <a href=\"https://twitter.com/uveta\">Twitter</a> to get notified as soon as they get published.</p>\n</body></html>",
            "tags": [
                "azure",
                "certification",
                "advanced"
            ]
        },
        {
            "id": "https://www.uveta.io/categories/blog/azure-solutions-architect-expert-part-1/",
            "url": "https://www.uveta.io/categories/blog/azure-solutions-architect-expert-part-1/",
            "title": "So you want to be an Azure Solutions Architect Expert - Part 1",
            "date_published": "2020-06-26T15:48:14.000Z",
            "content_html": "<html><head></head><body><img src=\"/categories/blog/azure-solutions-architect-expert-part-1/architect-badge.jpg\" class=\"\" title=\"Goal!!!\">\n\n<p>This post is intended for anyone actively trying to, or considering, obtaining Azure Solutions Architect Expert certification. As I have obtained certificate near the end of 2019, I wanted to share relevant information and findings gathered prior to and after taking exams, in order to help future applicants.</p>\n<span id=\"more\"></span>\n<p>This post is part of my Azure Architect certification guide:</p>\n<ul>\n<li><a href=\"/categories/blog/azure-solutions-architect-expert-part-1\">So you want to be an Azure Solutions Architect Expert - Part 1</a> (this post)</li>\n<li><a href=\"/categories/blog/azure-solutions-architect-expert-part-2\">So you want to be an Azure Solutions Architect Expert - Part 2</a></li>\n</ul>\n<p><em>Disclaimer: as AZ-300 and AZ-301 are being replaced with AZ-303 and AZ-304 exams late June 2020, you might find some information provided in this post to be outdated. I will try to take into account all information available for future versions and not go into details about topics that are becoming obsolete.</em></p>\n<h2 id=\"Prerequisites\"><a href=\"#Prerequisites\" class=\"headerlink\" title=\"Prerequisites\"></a>Prerequisites</h2><p>In order to qualify for Azure Solutions Architect Expert certification, you are required to pass two exams: AZ-300: Microsoft Azure Architect Technologies and AZ-301: Microsoft Azure Architect Design. While AZ-300 deals mostly with skills related to deploying and configuring individual services to Azure, AZ-301 takes a deep dive into fulfilling business and system requirements such as availability, reliability, performance, as well as optimizing costs. I will focus mostly on technical aspects and go briefly through the types of questions you would encounter. Organizational information, such as exam length, scoring and how to apply, will not be a part of this post. Such instructions can be obtained from <a href=\"https://docs.microsoft.com/en-us/learn/certifications/azure-solutions-architect\">Microsoft certification site</a></p>\n<h2 id=\"Where-to-find-study-materials\"><a href=\"#Where-to-find-study-materials\" class=\"headerlink\" title=\"Where to find study materials\"></a>Where to find study materials</h2><p><img src=\"microsoft-learn.png\" alt=\"Your new best friend\"></p>\n<p>Answer to this question is very simple: <a href=\"https://docs.microsoft.com/\">Microsoft Docs</a> has all the information you will ever need to prepare for this certification. The only problem is there a lot of it. Like, really a lot. Like, it would take you several lifetimes to only skim it through. Not to mention content is added to it on a daily basis. Still, official Microsoft documentation is the ultimate place where you will find answers to any question about Azure. It is also pretty easy to navigate and search for relevant information. If you have not worked with it already, take some time to familiarize yourself. Because you will be coming back to it regularly.</p>\n<p>Nick Colyer’s courses offered by <a href=\"https://courses.skylinesacademy.com/p/az-300-301\">Skylines Academy</a> helped me identify all relevant topics required for the exams. Both of them clock at about 20 hours in total, which could be covered in a single weekend, if you are persistent enough. The course aided me getting into meat and bones of each exam and understanding what is required to pass. I cannot recommend it enough, as the course should serve you as a starting point into further studying. As a bonus piece of information, both courses are also available on <a href=\"https://acloud.guru/azure-cloud-training\">A Cloud Guru</a>, which offers seven day free trial.</p>\n<p>On the other hand, Pluralsight has great paths for both <a href=\"https://www.pluralsight.com/paths/microsoft-azure-architect-technologies-az-300\">AZ-300</a> and <a href=\"https://www.pluralsight.com/paths/microsoft-azure-architect-design-az-301\">AZ-301</a> exam. Each path consists of dozen courses going into great depths of each topic covered. What I consider its greatest obstacle is the sheer amount of material, as both paths have, in total, well over 150 hours of video content. I would recommend them only to applicants who have enough time to spare. If you are not one of them, try to go through the materials at increased speed (1.2x or 1.3x works fine) or at least use them to selectively strengthen knowledge in areas you find yourself lacking. Pluralsight comes with a 10 day free trial, or, if you are lucky to have Visual Studio subscription, 3 to 6 months trial.</p>\n<p>Lastly, try to go through a couple of practice tests, especially if you have never participated in this kind of exam. Some of them are offered on <a href=\"https://docs.microsoft.com/en-us/learn/certifications/azure-solutions-architect\">Certification page</a>. Also, both <a href=\"https://www.udemy.com/course/azure-architect-technologies-practice-tests-az-300-az-303\">AZ-300/AZ-303</a> and <a href=\"https://www.udemy.com/course/az-301-azure-architect-design-practice-test\">AZ-301/AZ-304</a> packs can be found on Udemy.</p>\n<h2 id=\"So-you-want-to-Azure-AZ-300-Microsoft-Azure-Architect-Technologies\"><a href=\"#So-you-want-to-Azure-AZ-300-Microsoft-Azure-Architect-Technologies\" class=\"headerlink\" title=\"So you want to Azure (AZ-300: Microsoft Azure Architect Technologies)\"></a>So you want to Azure (AZ-300: Microsoft Azure Architect Technologies)</h2><p><img src=\"az-300-badge.jpg\" alt=\"AZ-300: Microsoft Azure Architect Technologies\"></p>\n<p>With basic information out of the way, it is time to plunge ourselves into technical skills required. Exam marked as AZ-300 will put your knowledge of Azure services, deployment, configuration and networking to test.</p>\n<h3 id=\"What-type-of-technology-questions-await\"><a href=\"#What-type-of-technology-questions-await\" class=\"headerlink\" title=\"What type of technology questions await\"></a>What type of technology questions await</h3><p>Technologies exam is a mixed bag of all <a href=\"https://www.microsoft.com/en-us/learning/certification-exams.aspx\">question types</a> that Microsoft is currently using. Best answer, multiple choice, drag and drop and case studies are just some of the formats you can expect.</p>\n<p>Beware, significant part of AZ-300 are also hands-on tasks done directly in simulated Azure portal. They usually involve deploying and configuring several resources according to specification. For this reason, you really need to be comfortable working with portal using GUI as well as CLI or Powershell. Read the tasks at hand thoroughly and understand what is required of you, as speed is of essence here. From my personal experience, this part of exam took nearly half of available time, which I only realized once I was finished with it. Try not to repeat my mistake.</p>\n<h3 id=\"Storage-resources\"><a href=\"#Storage-resources\" class=\"headerlink\" title=\"Storage resources\"></a>Storage resources</h3><p>Working with different types of persistence technologies is pretty straightforward, since Azure hides most of the infrastructure details and leaves us with a pretty well-established abstractions. Although each of them can be used in multiple ways, there is usually an obvious best choice fulfilling task requirements. Typical concerns regarding service options are as follows:</p>\n<ul>\n<li>Storage account. Bread-and-butter of all persistence technologies, it is used by almost all Azure services requiring storage, even without users being aware of it. As a solution architect, you are expected to know what kind of services it offers (blob, file, queue, table) as well as difference between historical versions, e.g. Gen1 and Gen2, since even obsolete ones are still being offered. For each individual service, you should understand various options offered during deployment and how do they impact created resource.</li>\n<li>CosmosDB. At the time of AZ-300 creation CosmosDB was still new kid on the block, hence most database related questions involved different types of SQL Server and DocumentDB deployments. This is changing in AZ-303, since CosmosDB is heavily featured in its curriculum as a de facto NoSQL standard in Azure. Make sure you are familiar with different application interfaces it offers and how to optimize usage based on functional requirements. Same goes for Azure SQL database, in case relational database solution is required.</li>\n<li>Azure Service Bus. Although not typically used for storage, it still offers persistence in certain scenarios. You should be aware how Service Bus is utilized as a messaging medium, and what sets it appart from services such as Event Grid and Azure Queue storage. Make sure you understand difference between queue, consumer, topic and subscribers, and when each one should be utilized.</li>\n<li>Data lake and Azure Files. These services have specific usage scenarios which you need to be aware of. While Data Lake plays a pivotal role in storing and processing extreme ammounts of data, Azure files are especially prominent in backup and migration solutions.</li>\n</ul>\n<h3 id=\"Network-and-connectivity\"><a href=\"#Network-and-connectivity\" class=\"headerlink\" title=\"Network and connectivity\"></a>Network and connectivity</h3><p>Networking area is pretty straightforward, as it follows a set of explicit rules with little space to be creative. But do not even attempt to dive into it if you have knowledge gaps in topics such as IP addresses, CIDR notation, subnets, public and private ranges or what DNS is and how it works. All of these are just basis for whats to come, so make sure you handle them well first.</p>\n<p>Exam specific topics include, but are not limited to:</p>\n<ul>\n<li>Virtual Networks (VNETs). Learn how to plan, deploy and configure them, how to use subnets effectively, what type of resources can be deployed to virtual network and what are the limitations.</li>\n<li>Connectivity. Find out what are the options when establishing connection between VNETs, on-premise locations and individual remote peers. Any combination is plausible, sometimes even all of them, and you need to know what kind of service is adequate for given scenario. Spend some time learning about VNET peering, ExpressRoute and VPN gateway.</li>\n<li>Routing and load balancing. Although not heavily emphasized in this exam, knowledge of different network appliances is still needed. Make sure you know what is the purpose of load balancer, custom appliances, Application Gateway, Traffic Manager and Azure Front Door, as well as basic deployment and configuration steps.</li>\n<li>Security. An important topic that can easily slip you by. You need to understand default security rules for resources deployed to VNETs and how to adjust them further. Do not miss reading on Network Security Groups (NSG), how to define individual security rules and where NSGs can be applied. Also, recognize what type of threats Web Application Firewall can protect your resources from and how to deploy it.</li>\n<li>DNS. Understand various Azure DNS service offerings. Make sure you know the difference between CNAME and A record and how they are used to perform different tasks in Azure. Examples include overriding default assigned server names or exposing deployed Azure services under your specific domain.</li>\n</ul>\n<h3 id=\"Compute-resources\"><a href=\"#Compute-resources\" class=\"headerlink\" title=\"Compute resources\"></a>Compute resources</h3><p><img src=\"compute-decision-tree.jpg\" alt=\"Compute service decision tree\"></p>\n<p>Realizing difference between service models offered by Azure is the key knowledge working with compute resources. Because all of them, in the end, have single purpose: to run a piece of code or application in cloud environment. Although there are many characteristics that will come into play in the design part, main point that you should take away for technology exam is the level of responsibility you have towards individual compute resources. Good overview of all Azure offerings is required as well, so make sure terms like Virtual Machines, App Service, Azure Functions and Kubernetes Service do not fall under your radar. Deploying and configuring all of them will be required of you, especially in the hands-on part of the exam.</p>\n<p>Note that, even though Service Fabric was part of AZ-300 curriculum, it is missing from AZ-303.</p>\n<h3 id=\"Monitoring-solutions\"><a href=\"#Monitoring-solutions\" class=\"headerlink\" title=\"Monitoring solutions\"></a>Monitoring solutions</h3><p>Tasks related to monitoring resources do not necessarily include only tools used to track performance and functionality of your deployment. Analytic services can help you optimize resource usage in order to provide more robust, flexible and often cheaper deploymen. Although complete monitoring solution often involves combination of several services, basic building blocks are:</p>\n<ul>\n<li>Log Analytics. Used to persist all log information. All services to follow utilize it either to store or read required data. Kusto language is used to query Log Analytics tables, but knowledge about its usage and syntax are no longer needed, as it was removed from AZ-303 curriculum.</li>\n<li>Azure Monitor. Fundamental service used to track various metrics gathered from underlying virtual machines. Although it is not deployed manually, ability to read Monitor metrics and define actions based on them will be expected of you.</li>\n<li>Application Insights. Often correlated with advanced compute resources, such as App Service and Azure Functions. How to track application metrics, logs and usage statistics is required knowledge for the exam.</li>\n<li>Action groups and Alerts. Although they represent separate entities in Azure, these two come hand in hand when developing notification solution. Double-check you are able to create alerts based on Azure resource metrics and notify appropriate targets.</li>\n<li>Azure Advisor. Even if you create advanced monitoring solution for your infrastructure and applications, covering wide range of system requirements, certain issues can slip under your radar. Azure Advisor can detect some of these automatically. It analyzes security, performance, reliability as well as cost of your deployment, and often helps optimize it based on preestablished rules. The exam will expect you to know basic issues that Azure advisor can help you solve.</li>\n</ul>\n<h3 id=\"Backup-and-migration\"><a href=\"#Backup-and-migration\" class=\"headerlink\" title=\"Backup and migration\"></a>Backup and migration</h3><p>A significant part of the curriculum is dedicated to migration from on-premise site to cloud environment, hence learning about available tools and how to utilize them is pretty much a necessity. Azure Migrate is a versatile service covering everything from analyzing on-site resource utilization, provisioning cloud counterparts and even executing planned migrations. Learning about its individual components and their specifics is the key to get by this part of the exam.</p>\n<p>On the other side, most notable backup services are covered by Azure Backup and Site Recovery. Since they play pivotal role in strengthening deployment resiliency and availability, they will be further mention during design exam post. For technological part, knowing how to deploy and configure them will suffice.</p>\n<h3 id=\"Security-components\"><a href=\"#Security-components\" class=\"headerlink\" title=\"Security components\"></a>Security components</h3><p>Since we mentioned security several times till now, it goes without saying it plays huge role in cloud environment. Azure is no different and offers you tools to finely adjust every part of your solution.</p>\n<p>Heart of security is Azure AD, which is utilized in every aspect requiring authentication or authorization. Whether your solution is deployed purely to cloud, or you wish to combine it with on-premise resources, Azure has appropriate offering for you. Verify what the desired scenario is and know what kind of deployment is suitable.</p>\n<p>Abbreviations such as RBAC, MFA, OAuth, OpenID and SAS must mean something to you. You have to be able to control and monitor user access to Azure resources and utilize advanced options offered by premium licenses. Know how to use Managed Identity and Security Principals to control service access to Azure resources. Learn how Key Vault can help store sensitive data and how to utilize it.</p>\n<h3 id=\"Deployment\"><a href=\"#Deployment\" class=\"headerlink\" title=\"Deployment\"></a>Deployment</h3><p>If you go back and read previous sections, the most frequent word used would probably be deployment. Since it plays a mayor role even before you start working with resources in Azure, it deserves an honorary mention.</p>\n<p>Azure Resource Manager templates, or simply ARM, is a term you will most definitely encounter when dealing with resource deployments. Understanding basic structure of ARM and how to export, as well as adjust them, will be expected of you. They can immensely help you during hands-on parts as well, especially if multiple resource deployment is required.</p>\n<h2 id=\"Conclusion\"><a href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"></a>Conclusion</h2><p>In this post I went through Azure Solutions Architect Expert certification prerequisites and recommended learning strategy. I have also covered most significant topics that you can encounter during first certification exam.</p>\n<p>In the next post I will go through skills and knowledge required for the second exam, i.e. AZ-301: Microsoft Azure Architect Design. Follow me on <a href=\"https://twitter.com/uveta\">Twitter</a> to get notified when it gets published.</p>\n</body></html>",
            "tags": [
                "azure",
                "certification",
                "advanced"
            ]
        }
    ]
}