{
    "version": "https://jsonfeed.org/version/1",
    "title": "Uveta's blog • All posts by \"github\" tag",
    "description": "Uveta's blog about all things Azure",
    "home_page_url": "https://www.uveta.io",
    "items": [
        {
            "id": "https://www.uveta.io/categories/blog/github-workflow-unity-azure-static-webapps/",
            "url": "https://www.uveta.io/categories/blog/github-workflow-unity-azure-static-webapps/",
            "title": "Using GitHub workflow to deploy Unity project to Azure Static Web Apps",
            "date_published": "2022-12-19T10:17:46.000Z",
            "content_html": "<html><head></head><body><img src=\"/categories/blog/github-workflow-unity-azure-static-webapps/github.jpg\" class=\"\" title=\"GitHub\">\n\n<p>This post explains how to create a GitHub workflow, which builds, tests and deploys a Unity project to Azure Static Web Apps (SWA) instance. Due to foundations on which SWA was built upon, it represents a perfect way to develop and test any game built on Unity WebGL platform.</p>\n<span id=\"more\"></span>\n\n<p><em>This post is part of <strong>.NET Advent 2022!</strong> Check other great entries <a href=\"https://dotnet.christmas/\">here</a>.</em></p>\n<h2 id=\"Introduction\"><a href=\"#Introduction\" class=\"headerlink\" title=\"Introduction\"></a>Introduction</h2><p>I created this workflow as a part of another activity. It involved remastering Hungry Square, a game I once developed, into Unity. If you want to have the whole context, check out <a href=\"../unity-in-21-days\">my other post, about how I learned Unity in 21 days</a>.</p>\n<h2 id=\"CI-CD-Pipeline\"><a href=\"#CI-CD-Pipeline\" class=\"headerlink\" title=\"CI/CD Pipeline\"></a>CI/CD Pipeline</h2><p>Forget that we are actually working with Unity. Lets consider our game project just another web application. A well-established way to write a web app CI/CD pipeline is to break it into three steps: project build, infrastructure deploy, and application bundle deploy. Lets take a deeper look into each one.</p>\n<h3 id=\"Building-and-testing-Unity-project\"><a href=\"#Building-and-testing-Unity-project\" class=\"headerlink\" title=\"Building and testing Unity project\"></a>Building and testing Unity project</h3><p>We’re starting off in uncharted territory, at least for me. Building Unity projects was something I was not too familiar with. Luckily, good folks at <a href=\"https://game.ci/docs/\">game.ci</a> provide a convenient way how to work with Unity games, in GitHub environment. Setting up a build job is straightforward, and involves following steps:</p>\n<ul>\n<li>Ensure Unity license, username, and password are provided to workflow, via GitHub secrets. Details on activating license and setting up secrets, depending on license type, can be found in <a href=\"https://game.ci/docs/github/activation\">game.ci documentation</a></li>\n<li>Run any tests in project using <a href=\"https://game.ci/docs/github/test-runner\">game-ci/unity-test-runner</a> action.</li>\n<li>Build project for all configured platforms using <a href=\"https://game.ci/docs/github/builder\">game-ci/unity-builder</a> action.</li>\n<li>Optionally, use <a href=\"https://github.com/actions/cache\">actions/cache</a> action to cache dynamic project files. This often reduces build time dramatically.</li>\n<li>Finally, make build output available to succeeding jobs via <a href=\"https://github.com/actions/upload-artifact\">actions/upload-artifact</a>.</li>\n</ul>\n<script src=\"https://gist.github.com/uveta/16b5583b4d2961cd16994404320f1f10.js\"></script>\n\n<p>If all steps have finished without an error, we should end up with an artifact containing our application bundle.</p>\n<h3 id=\"Infrastructure\"><a href=\"#Infrastructure\" class=\"headerlink\" title=\"Infrastructure\"></a>Infrastructure</h3><p>When setting up this type of projects, we should make no assumptions about existing deployment environment. It is why I have included a job to create all necessary infrastructure. There is an abundance of ways how to programmatically deploy to Azure (CLI, PowerShell, Terraform, etc.), each one with its pros and cons. In our case, the optimal way was using Bicep domain-specific language, which offers a good balance between complexity, robustness and extensibility. For this purpose, we will deploy a resource group, in which a SWA instance will be created. All necessary templates can be found in <a href=\"https://github.com/uveta/hungry-square-unity/tree/main/infra\">./infra</a> directory.</p>\n<p>As with almost all actions in Azure, Bicep deployment has to be preceded with an Azure login step. Detailed instructions on how to setup subscription identifier and login credentials, using GitHub secrets, can be found in <a href=\"https://github.com/Azure/login\">Azure login action documentation</a>. Subsequent Bicep deployment is done using <a href=\"https://github.com/Azure/arm-deploy\">azure/arm-deploy</a> action.</p>\n<script src=\"https://gist.github.com/uveta/c4542f2218751bb128ffa48b4106c06d.js\"></script>\n\n<h3 id=\"Deploying-to-Azure-Static-Web-Apps\"><a href=\"#Deploying-to-Azure-Static-Web-Apps\" class=\"headerlink\" title=\"Deploying to Azure Static Web Apps\"></a>Deploying to Azure Static Web Apps</h3><p>Deployment of application bundle to a SWA instance consists of two steps (or four if you are nitpicking and want to include artifact download and Azure login). Prior to actual upload, a deployment token for SWA must be obtained. We will use <a href=\"https://github.com/Azure/cli\">Azure CLI</a> to get it and store it in a job environment variable <em>SWA_DEPLOYMENT_TOKEN</em>.</p>\n<p>Uploading build output to SWA is done using <a href=\"https://github.com/Azure/static-web-apps-deploy\">azure/static-web-apps-deploy</a> action. In our case, following parameters have to be included:</p>\n<ul>\n<li><strong>azure_static_web_apps_api_token</strong>, a deployment token obtained in previous step</li>\n<li><strong>repo_token</strong>, a GitHub token with appropriate permissions, which action will use to provide URL to access our application</li>\n<li><strong>app_location</strong>, directory or file to upload to SWA, which is in our case <em>./build/WebGL/WebGL</em></li>\n</ul>\n<script src=\"https://gist.github.com/uveta/00d40c2d5ddae36762a05cb0b1f8fe94.js\"></script>\n\n<h3 id=\"Bonus-environment-tear-down\"><a href=\"#Bonus-environment-tear-down\" class=\"headerlink\" title=\"Bonus (environment tear down)\"></a>Bonus (environment tear down)</h3><p>After a pull request is merged or abandoned, and a feature branch was deleted, it is appropriate to clean up associated SWA environment. This can easily be done via <a href=\"https://github.com/uveta/hungry-square-unity/blob/main/.github/workflows/teardown.yaml\">tear down workflow</a>, which also uses <a href=\"https://github.com/Azure/static-web-apps-deploy\">SWA action</a>. Similar to code upload, a deployment token has to be obtained first. Afterwards, an SWA action with action parameter set to <em>close</em> is executed, which will remove environment associated with current git branch.</p>\n<script src=\"https://gist.github.com/uveta/6438618e956a75217f42915bd007a6fd.js\"></script>\n\n<h2 id=\"Final-thoughts\"><a href=\"#Final-thoughts\" class=\"headerlink\" title=\"Final thoughts\"></a>Final thoughts</h2><p>After spending couple of days, making sure that the project is built and deployed properly, I can give you some tips to make designing your future workflow more smooth:</p>\n<ul>\n<li>Make sure you add <em>.gitattributes</em> with proper Git LFS definitions early, ideally before including any asset. Although git makes migration of committed assets to LFS super convenient, it requires rewriting branch history and force pushing it. Not something you really want to do, if you have a whole team collaborating on a project.</li>\n<li>Unity build action will fail, if source files were modified after checkout. As a last resort, you can force execution of a dirty build, using <em>game-ci/unity-builder</em> action parameters.</li>\n<li>Double-check all included scenes in Unity Editor, in File-&gt;Build Settings-&gt;Scenes In Build. In case of any issue with scenes, build error will not help you much.</li>\n<li>It might not be clear what is the correct path of application bundle in build artifact, as it is located under a couple of levels of directories. Verify path by manually downloading artifact bundle, and adjust <em>app_location</em> parameter of <em>azure/static-web-apps-deploy</em> step accordingly.</li>\n</ul>\n<h2 id=\"Conclusion\"><a href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"></a>Conclusion</h2><p>There you have it, a workflow to help you get any Unity WebGL project up and running in minutes. You can check out the final CI/CD workflow <a href=\"https://github.com/uveta/hungry-square-unity/blob/main/.github/workflows/ci.yaml\">here</a>.</p>\n</body></html>",
            "tags": [
                "azure",
                "advanced",
                "dotnet",
                "unity",
                "github",
                "devops"
            ]
        }
    ]
}